In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(columns=["Name", "Age", "Height"])

In [3]:
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [4]:
df.loc[0] = ["Allen", 22, 175]

In [5]:
df

    Name  Age  Height
0  Allen   22     175

In [6]:
df.loc[1] = ["Ted", 25, 180]
df.loc[2] = ["Jack", 28, 177]

df

    Name  Age  Height
0  Allen   22     175
1    Ted   25     180
2   Jack   28     177

In [7]:
df["Age"]

0    22
1    25
2    28
Name: Age, dtype: int64

In [8]:
df["Weight"] = [75, 80, 85]

In [9]:
df

    Name  Age  Height  Weight
0  Allen   22     175      75
1    Ted   25     180      80
2   Jack   28     177      85

In [12]:
df.drop(["Weight"])

KeyError: "['Weight'] not found in axis"

In [13]:
df.drop(["Weight"], axis=1)

    Name  Age  Height
0  Allen   22     175
1    Ted   25     180
2   Jack   28     177

In [14]:
df

    Name  Age  Height  Weight
0  Allen   22     175      75
1    Ted   25     180      80
2   Jack   28     177      85

In [15]:
df = df.drop(["Weight"], axis=1)

In [16]:
df

    Name  Age  Height
0  Allen   22     175
1    Ted   25     180
2   Jack   28     177

In [17]:
df.drop(2)

    Name  Age  Height
0  Allen   22     175
1    Ted   25     180

In [18]:
df

    Name  Age  Height
0  Allen   22     175
1    Ted   25     180
2   Jack   28     177

In [19]:
df = df.drop(2)

In [20]:
df

    Name  Age  Height
0  Allen   22     175
1    Ted   25     180

In [21]:
df["Height"] = [180, 185]
df

    Name  Age  Height
0  Allen   22     180
1    Ted   25     185

In [22]:
df["Height"] = 190
df

    Name  Age  Height
0  Allen   22     190
1    Ted   25     190

In [23]:
columns = ["Name", "Age", "Height"]
data = [
    ["Jake", 26, 180],
    ["Trump", 23, 185],
]

df2 = pd.DataFrame(
    data=data,
    columns=columns,
)

df2

    Name  Age  Height
0   Jake   26     180
1  Trump   23     185

In [24]:
df_union = pd.concat(
    [df, df2],
)

df_union

    Name  Age  Height
0  Allen   22     190
1    Ted   25     190
0   Jake   26     180
1  Trump   23     185

In [26]:
df_union = pd.concat(
    [df, df2],
).reset_index(drop=True)

df_union

    Name  Age  Height
0  Allen   22     190
1    Ted   25     190
2   Jake   26     180
3  Trump   23     185

In [28]:
df_union.to_csv("basic.csv", index=False)

In [30]:
df_union.to_csv(
    "basic_no_columns.csv",
    index=False,
    header=None,
)

In [31]:
df

    Name  Age  Height
0  Allen   22     190
1    Ted   25     190

In [32]:
df_replica = df

In [33]:
df["Age"] = 28

In [34]:
df

    Name  Age  Height
0  Allen   28     190
1    Ted   28     190

In [35]:
df_replica

    Name  Age  Height
0  Allen   28     190
1    Ted   28     190

In [36]:
df_replica = df.copy()

In [37]:
df["Height"] = 180
df

    Name  Age  Height
0  Allen   28     180
1    Ted   28     180

In [38]:
df_replica

    Name  Age  Height
0  Allen   28     190
1    Ted   28     190